Revit 2027 API
EnergyAnalysisDetailModelTier Enumeration
 Level of computation for energy analysis model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EnergyAnalysisDetailModelTier
Public Enumeration EnergyAnalysisDetailModelTier
public enum class EnergyAnalysisDetailModelTier
type EnergyAnalysisDetailModelTier
Members
Member name | Value | Description
Final | 3 |  Constructions, schedules, non-graphical data.
FirstLevelBoundaries | 1 |  Spaces and zones, e.g. minimal need for display. This refers to the analytical spaces. The analytical spaces are produced from Rooms if you are using RAC, and from MEP Spaces if you are using RME.
NotComputed | 0 |  Not computed.
SecondLevelBoundaries | 2 |  Analytical surfaces.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace